algorithms/60-Permutation-Sequence.org
#+TITLE: 60. Permutation Sequence

The set [1,2,3,...,n] contains a total of n! unique permutations.

By listing and labeling all of the permutations in order, we get the following sequence for n = 3:

#+begin_example
"123"
"132"
"213"
"231"
"312"
"321"
#+end_example

Given n and k, return the kth permutation sequence.

Note:

Given n will be between 1 and 9 inclusive.

Given k will be between 1 and n! inclusive.


Example 1:

#+begin_example
Input: n = 3, k = 3
Output: "213"
#+end_example

Example 2:
#+begin_example
Input: n = 4, k = 9
Output: "2314"
#+end_example


* 题意分析
给一个有n个元素的set集合，全排列后，取第k大序列

思路分析

* java


* python