algorithms/60-Permutation-Sequence.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>60. Permutation Sequence</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">60. Permutation Sequence</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgafcf86f">1. 题意分析</a></li>
<li><a href="#org4967fa1">2. java</a></li>
<li><a href="#org6b57c82">3. python</a></li>
</ul>
</div>
</div>
<p>
The set [1,2,3,&#x2026;,n] contains a total of n! unique permutations.<br>
</p>

<p>
By listing and labeling all of the permutations in order, we get the following sequence for n = 3:<br>
</p>

<pre class="example">
"123"
"132"
"213"
"231"
"312"
"321"
</pre>

<p>
Given n and k, return the kth permutation sequence.<br>
</p>

<p>
Note:<br>
</p>

<p>
Given n will be between 1 and 9 inclusive.<br>
</p>

<p>
Given k will be between 1 and n! inclusive.<br>
</p>


<p>
Example 1:<br>
</p>

<pre class="example">
Input: n = 3, k = 3
Output: "213"
</pre>

<p>
Example 2:<br>
</p>
<pre class="example">
Input: n = 4, k = 9
Output: "2314"
</pre>


<div id="outline-container-orgafcf86f" class="outline-2">
<h2 id="orgafcf86f"><span class="section-number-2">1</span> 题意分析</h2>
<div class="outline-text-2" id="text-1">
<p>
给一个有n个元素的set集合，全排列后，取第k大序列<br>
</p>

<p>
思路分析<br>
</p>
</div>
</div>

<div id="outline-container-org4967fa1" class="outline-2">
<h2 id="org4967fa1"><span class="section-number-2">2</span> java</h2>
</div>


<div id="outline-container-org6b57c82" class="outline-2">
<h2 id="org6b57c82"><span class="section-number-2">3</span> python</h2>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>